util/examples/setup-dcn1.xml

POST /VersaNS-0.0.1-SNAPSHOT/NPService HTTP/1.1
User-Agent: wsdlpull/1.23
Host: localhost:8080
SOAPAction:
"setup"
Content-Type: text/xml; charset=UTF-8
Accept: text/xml;
Content-Length: CONTENT_LENGTH

<?xml version='1.0' encoding='UTF-8' standalone='no' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns1="http://aggregate.geni.net/services/api/">
    <SOAP-ENV:Body>
        <setup xmlns="http://maxgigapop.net/versans/nps/api/">
            <transactionId>trans-12345</transactionId>
            <description>test</description>
            <serviceContract id="svc-dcn-10014" type="dcn-layer2">
                <customerSTP id="urn:ogf:network:domain=dragon.maxgigapop.net:node=CLPK:port=1-2-3:link=*">
                    <interfaceRef>customer-A-srcif</interfaceRef>
                    <layer2Info>
                        <outerVlanTag>any</outerVlanTag>            
                    </layer2Info>
                </customerSTP>
                <customerSTP id="urn:ogf:network:domain=dragon.maxgigapop.net:node=CLPK:port=1-1-2:link=*">
                    <interfaceRef>customer-A-dstif</interfaceRef>
                    <layer2Info>
                        <outerVlanTag>any</outerVlanTag>            
                    </layer2Info>
                </customerSTP>
                <policyData>
                    <subject>provider</subject>
                    <resourceRef type="network">all</resourceRef>
                    <action>limit</action>
                    <constraintType>bandwidth</constraintType>
                    <constraintValue>101Mbps</constraintValue>
                </policyData>
            </serviceContract>
        </setup>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
